app/controllers/galleries_controller.rb

  def show
    @gallery = Gallery.find(params[:id])
---
SELECT `galleries`.* FROM `galleries` WHERE `galleries`.`id` = 1 LIMIT 1

  def index
    @galleries = Gallery.all
---
SELECT `galleries`.* FROM `galleries`

  def edit
    @gallery = Gallery.find(params[:id])
---
SELECT `galleries`.* FROM `galleries` WHERE `galleries`.`id` = 1 LIMIT 1

  def create
     @gallery = Gallery.new(params[:gallery])
    if @gallery.save
---
INSERT INTO `galleries` (`created_at`, `name`, `updated_at`) VALUES ('2012-05-07 08:34:06', 'tapan album', '2012-05-07 08:34:06')