app/controllers/users_controller.rb

INSERT INTO `users` (`address`, `created_at`, `dob`, `email`, `encrypted_password`, `name`, `salt`, `updated_at`) VALUES (NULL, '2012-05-04 13:32:59', '0012-12-12', 'tapancse143@gmail.com', '56a571c516cb9216a68ffc66be0d05653c4bdf235c19be566ce65fefdb3a607a', 'tapan pati', 'd7131bf675560d0f8e8b4e597f136301991332c7858c17128ce9e3eb0c691c32', '2012-05-04 13:32:59')
---
  def create
    @user = User.new(params[:user])
    respond_to do |format|
    if @user.save