app/views/galleries/show.html.erb


  <% @gallery.images.each do |photo| %>
---
SELECT `images`.* FROM `images` WHERE `images`.`gallery_id` = 1